app/controllers/articles_controller.rb

  def create
    redirect_to root_url unless user_signed_in?
    @article = Article.new(article_params)
    @article.user_id = current_user.id
    @article.save!
---
INSERT INTO "articles" ("article_title", "article_data", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["article_title", "title"], ["article_data", "body"], ["created_at", "2020-06-25 08:26:45.430138"], ["updated_at", "2020-06-25 08:26:45.430138"]]